dbaeumer.vscode-eslint
be5invis.toml
bradlc.vscode-tailwindcss
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
file-icons.file-icons
formulahendry.auto-rename-tag
golang.go
jgclark.vscode-todo-highlight
juanblanco.solidity
mhutchie.git-graph
ms-python.python
ms-python.vscode-pylance
ms-vscode.cpptools
ms-vscode.hexeditor
prisma.prisma
rangav.vscode-thunder-client
rust-lang.rust-analyzer
streetsidesoftware.code-spell-checker
svelte.svelte-vscode
tombonnike.vscode-status-bar-format-toggle
usernamehw.errorlens
vadimcn.vscode-lldb
visualstudioexptteam.vscodeintellicode
vscodevim.vim
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
ziglang.vscode-zig
